In [10]:
import pandas as pd
import matplotlib.pyplot as plt

In [11]:
data = {
    "name" : ["Daniel", "Theo", "Aretha"],
    "score" : [98, 60, 58]
}

In [12]:
df = pd.DataFrame(data)

In [13]:
df

     name  score
0  Daniel     98
1    Theo     60
2  Aretha     58

### Reading From CSV File

In [15]:
sales_data = pd.read_csv("dataset/sales_data.csv")

#### Top Five Records

In [16]:
sales_data.head(5)

   id                 product_name       price  stock  date_added
0   1  Gardening Gloves with Claws  $790885.80      9  12/11/2024
1   2                 Rice Pudding  $162401.24     18    8/3/2022
2   3                  Fishing Rod  $245343.84     20   16/3/2021
3   4        Portable Air Purifier  $438836.66      3   26/9/2025
4   5    Teriyaki Chicken Stir-Fry    $7092.93      3   2/12/2022

In [17]:
#Buttom record
sales_data.tail(5)

       id                  product_name       price  stock date_added
995   996       Cinnamon Spiced Almonds  $850968.14     15  10/7/2022
996   997                 Whole Chicken  $820855.46     20   6/8/2025
997   998  Fitness Resistance Bands Set  $149317.06     13   3/9/2023
998   999           Under Desk Footrest  $722419.13      3  24/9/2020
999  1000             Organic Green Tea  $528998.94     17   9/7/2025